# 빈 자리는 빈 공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보
# print("{0: >10}".format(500))
#       500
# 양수일 떈 +, 음수일 땐 -로 표시
# print("{0: >+10}".format(500))
# print("{0: >+10}".format(-500))
    #   +500
    #   -500
# 왼쪽 정렬, 빈칸을 _로 채움
# print("{0:_<+10}".format(500))
# +500______
# 3자리 마다 콤마찍기
# print("{0:,}".format(100000000000))
# 100,000,000,000
# print("{0:^<+30,}".format(100000000000))
# print("{0:v<+30,}".format(-100000000000))
# +100,000,000,000
# -100,000,000,000

# 3자리마다 콤마찍기 + 부호 + 자릿수 확보
# 빈자리 ^
# print("{0:^<+30,}".format(1000000000000))
# print("{0:^<+30,}".format(-1000000000000))

# 소수점 출력
print("{0:f}".format(5/3))
print("{0:.2f}".format(5/3)) # 반올림